data_generation/simulation_results/of/case_62/constant/simParams
nIter 2000;
hComponent0 923.1281698655816;
hComponent1 838.2584431821134;
hComponent2 1479.2064538787386;
hComponent3 612.8663465255565;
hComponent4 1117.9380364178478;kComponent0 44.47184595493142;
kComponent1 26.07202496167132;
kComponent2 47.157736196383084;
kComponent3 20.213030432231;
kComponent4 41.73016967922702;
tAmbient 300;
Ux 2.2310513329655928;
kPCB 0.5356922531352543;