data_generation/simulation_results/of/case_62/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    empty
    {
        type            empty;
    }
    walls
    {
        type            fixedFluxPressure;
    }
    inlet
    {
        type            fixedFluxPressure;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    "fluid_to_component_.*"
    {
        type            fixedFluxPressure;
    }
    fluid_to_pcb
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
